interfaces/src/main/resources/templates/GeefBetalingenHandicap/03.00.0000/template.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:web="http://magda.vlaanderen.be/soczek/soap/geefbetalingenhandicap/v03_00">
    <soapenv:Header/>
    <soapenv:Body>
        <web:GeefBetalingenHandicap>
            <Verzoek>
                <Context>
                    <Naam>GeefBetalingenHandicap</Naam>
                    <Versie>03.00.0000</Versie>
                    <Bericht>
                        <Type>VRAAG</Type>
                        <Tijdstip>
                            <Datum>2025-01-01</Datum>
                            <Tijd>12:00</Tijd>
                        </Tijdstip>
                        <Afzender>
                            <Identificatie>Identificatie</Identificatie>
                            <Referte>Referte</Referte>
                            <Hoedanigheid>Hoedanigheid</Hoedanigheid>
                        </Afzender>
                    </Bericht>
                </Context>
                <Vragen>
                    <Vraag>
                        <Referte>Referte</Referte>
                        <Criteria>
                            <ConsultPaymentsCriteria>
                                <ssin>90010100123</ssin>
                                <handicapAuthenticSources>
                                </handicapAuthenticSources>
                                <period>
                                    <beginDate>2025-01-01</beginDate>
                                    <endDate>2026-01-01</endDate>
                                </period>
                            </ConsultPaymentsCriteria>
                        </Criteria>
                    </Vraag>
                </Vragen>
            </Verzoek>
        </web:GeefBetalingenHandicap>
    </soapenv:Body>
</soapenv:Envelope>